InformationRegisters/СоответствиеНастроекИнтеграцииИнтернетЭквайринг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНастроекИнтеграцииИнтернетЭквайринг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКИнтернетЭквайрингу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНастроекИнтеграцииПлатежныеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНастроекИнтеграцииПлатежныеСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКПлатежнымСистемам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИнтеграцияСПлатежнымиСистемамиБПВызовСервера/Ext/Module.bsl
Функция ВозвратОплатыСчет(ДокументВозврата, ПараметрыОперации, АдресРезультата) Экспорт
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументВозврата, "Организация, ВидОплаты, ДокументОснование");
	ДокументОплаты = Документы.ОплатаПлатежнойКартой.СчетНаОплату(РеквизитыОснования.ДокументОснование);
	
	Если ПараметрыОперации.СпособОплатыОнлайнЗаказы = "Эквайринг" Тогда
		Настройка = РегистрыСведений.СоответствиеНастроекИнтеграцииИнтернетЭквайринг.НастройкаИнтеграции(РеквизитыОснования.Организация, РеквизитыОснования.ВидОплаты);
	Иначе
		Настройка = РегистрыСведений.СоответствиеНастроекИнтеграцииПлатежныеСистемы.НастройкаИнтеграции(РеквизитыОснования.Организация, РеквизитыОснования.ВидОплаты);
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументВозврата", ДокументВозврата);
	ПараметрыПроцедуры.Вставить("ДокументОплаты",   ДокументОплаты);
	ПараметрыПроцедуры.Вставить("СпособОплатыОнлайнЗаказы", ПараметрыОперации.СпособОплатыОнлайнЗаказы);
	ПараметрыПроцедуры.Вставить("НастройкаИнтеграции", Настройка);
	
	ИнтеграцияСПлатежнымиСистемамиБП.ВозвратОплаты(ПараметрыПроцедуры, АдресРезультата);
	
	РезультатВозвратОплаты = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Возврат РезультатВозвратОплаты;
	
КонецФункции

Функция СтатусВозврата(УникальныйИдентификатор, ДокументВозврата, СпособОплаты) Экспорт
	
	ИмяМодуля = ?(СпособОплаты = "Эквайринг", "ИнтернетЭквайринг", "ПлатежныеСистемы");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		УникальныйИдентификатор, ИмяМодуля + ".СтатусОперации", ДокументВозврата, Истина);
	
КонецФункции
